{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": 60,
    "1": 41,
    "2": 40,
    "3": 45,
    "4": 164,
    "5": 172,
    "6": 88,
    "7": 2,
    "8": 181,
    "9": 162,
    "10": 35,
    "11": 46,
    "12": 203,
    "13": 124,
    "14": 84,
    "15": 153,
    "16": 31,
    "17": 3,
    "18": 11,
    "19": 4,
    "20": 189,
    "21": 8,
    "22": 201,
    "23": 19,
    "24": 122,
    "25": 83,
    "26": 25,
    "27": 0,
    "28": 17,
    "29": 196,
    "30": 173,
    "31": 30,
    "32": 66,
    "33": 135,
    "34": 104,
    "35": 112,
    "36": 32,
    "37": 193,
    "38": 68,
    "39": 14,
    "40": 152,
    "41": 141,
    "42": 198,
    "43": 171,
    "44": 170,
    "45": 16,
    "46": 42,
    "47": 187,
    "48": 125,
    "49": 200,
    "50": 26,
    "51": 123,
    "52": 197,
    "53": 61,
    "54": 98,
    "55": 165,
    "56": 54,
    "57": 131,
    "58": 137,
    "59": 47,
    "60": 74,
    "61": 87,
    "62": 27,
    "63": 144,
    "64": 100,
    "65": 36,
    "66": 167,
    "67": 199,
    "68": 7,
    "69": 175,
    "70": 9,
    "71": 166,
    "72": 15,
    "73": 138,
    "74": 168,
    "75": 92,
    "76": 28,
    "77": 97,
    "78": 140,
    "79": 149,
    "80": 174,
    "81": 73,
    "82": 154,
    "83": 55,
    "84": 157,
    "85": 191,
    "86": 139,
    "87": 5,
    "88": 49,
    "89": 176,
    "90": 184,
    "91": 148,
    "92": 51,
    "93": 188,
    "94": 103,
    "95": 132,
    "96": 118,
    "97": 108,
    "98": 113,
    "99": 126,
    "100": 202,
    "101": 146,
    "102": 186,
    "103": 1,
    "104": 38,
    "105": 151,
    "106": 6,
    "107": 133,
    "108": 52,
    "109": 72,
    "110": 99,
    "111": 147,
    "112": 20,
    "113": 34,
    "114": 56,
    "115": 109,
    "116": 102,
    "117": 114,
    "118": 29,
    "119": 39,
    "120": 89,
    "121": 10,
    "122": 65,
    "123": 121,
    "124": 75,
    "125": 80,
    "126": 78,
    "127": 59,
    "128": 53,
    "129": 79,
    "130": 143,
    "131": 136,
    "132": 82,
    "133": 185,
    "134": 128,
    "135": 120,
    "136": 81,
    "137": 158,
    "138": 94,
    "139": 48,
    "140": 76,
    "141": 13,
    "142": 64,
    "143": 43,
    "144": 182,
    "145": 119,
    "146": 50,
    "147": 192,
    "148": 101,
    "149": 12,
    "150": 85,
    "151": 159,
    "152": 190,
    "153": 24,
    "154": 111,
    "155": 18,
    "156": 150,
    "157": 155,
    "158": 90,
    "159": 77,
    "160": 44,
    "161": 91,
    "162": 22,
    "163": 179,
    "164": 161,
    "165": 62,
    "166": 63,
    "167": 160,
    "168": 115,
    "169": 70,
    "170": 110,
    "171": 180,
    "172": 96,
    "173": 130,
    "174": 142,
    "175": 23,
    "176": 67,
    "177": 58,
    "178": 169,
    "179": 177,
    "180": 163,
    "181": 116,
    "182": 71,
    "183": 178,
    "184": 129,
    "185": 106,
    "186": 105,
    "187": 37,
    "188": 107,
    "189": 134,
    "190": 195,
    "191": 21,
    "192": 156,
    "193": 57,
    "194": 127,
    "195": 183,
    "196": 69,
    "197": 86,
    "198": 95,
    "199": 93,
    "200": 194,
    "201": 145,
    "202": 117,
    "203": 33
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "0": 27,
    "1": 103,
    "2": 7,
    "3": 17,
    "4": 19,
    "5": 87,
    "6": 106,
    "7": 68,
    "8": 21,
    "9": 70,
    "10": 121,
    "11": 18,
    "12": 149,
    "13": 141,
    "14": 39,
    "15": 72,
    "16": 45,
    "17": 28,
    "18": 155,
    "19": 23,
    "20": 112,
    "21": 191,
    "22": 162,
    "23": 175,
    "24": 153,
    "25": 26,
    "26": 50,
    "27": 62,
    "28": 76,
    "29": 118,
    "30": 31,
    "31": 16,
    "32": 36,
    "33": 203,
    "34": 113,
    "35": 10,
    "36": 65,
    "37": 187,
    "38": 104,
    "39": 119,
    "40": 2,
    "41": 1,
    "42": 46,
    "43": 143,
    "44": 160,
    "45": 3,
    "46": 11,
    "47": 59,
    "48": 139,
    "49": 88,
    "50": 146,
    "51": 92,
    "52": 108,
    "53": 128,
    "54": 56,
    "55": 83,
    "56": 114,
    "57": 193,
    "58": 177,
    "59": 127,
    "60": 0,
    "61": 53,
    "62": 165,
    "63": 166,
    "64": 142,
    "65": 122,
    "66": 32,
    "67": 176,
    "68": 38,
    "69": 196,
    "70": 169,
    "71": 182,
    "72": 109,
    "73": 81,
    "74": 60,
    "75": 124,
    "76": 140,
    "77": 159,
    "78": 126,
    "79": 129,
    "80": 125,
    "81": 136,
    "82": 132,
    "83": 25,
    "84": 14,
    "85": 150,
    "86": 197,
    "87": 61,
    "88": 6,
    "89": 120,
    "90": 158,
    "91": 161,
    "92": 75,
    "93": 199,
    "94": 138,
    "95": 198,
    "96": 172,
    "97": 77,
    "98": 54,
    "99": 110,
    "100": 64,
    "101": 148,
    "102": 116,
    "103": 94,
    "104": 34,
    "105": 186,
    "106": 185,
    "107": 188,
    "108": 97,
    "109": 115,
    "110": 170,
    "111": 154,
    "112": 35,
    "113": 98,
    "114": 117,
    "115": 168,
    "116": 181,
    "117": 202,
    "118": 96,
    "119": 145,
    "120": 135,
    "121": 123,
    "122": 24,
    "123": 51,
    "124": 13,
    "125": 48,
    "126": 99,
    "127": 194,
    "128": 134,
    "129": 184,
    "130": 173,
    "131": 57,
    "132": 95,
    "133": 107,
    "134": 189,
    "135": 33,
    "136": 131,
    "137": 58,
    "138": 73,
    "139": 86,
    "140": 78,
    "141": 41,
    "142": 174,
    "143": 130,
    "144": 63,
    "145": 201,
    "146": 101,
    "147": 111,
    "148": 91,
    "149": 79,
    "150": 156,
    "151": 105,
    "152": 40,
    "153": 15,
    "154": 82,
    "155": 157,
    "156": 192,
    "157": 84,
    "158": 137,
    "159": 151,
    "160": 167,
    "161": 164,
    "162": 9,
    "163": 180,
    "164": 4,
    "165": 55,
    "166": 71,
    "167": 66,
    "168": 74,
    "169": 178,
    "170": 44,
    "171": 43,
    "172": 5,
    "173": 30,
    "174": 80,
    "175": 69,
    "176": 89,
    "177": 179,
    "178": 183,
    "179": 163,
    "180": 171,
    "181": 8,
    "182": 144,
    "183": 195,
    "184": 90,
    "185": 133,
    "186": 102,
    "187": 47,
    "188": 93,
    "189": 20,
    "190": 152,
    "191": 85,
    "192": 147,
    "193": 37,
    "194": 200,
    "195": 190,
    "196": 29,
    "197": 52,
    "198": 42,
    "199": 67,
    "200": 49,
    "201": 22,
    "202": 100,
    "203": 12
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.47.1"
}
